{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"luma_lut": {"name": "luma_lut:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "5"}]}}, "color_lut": {"name": "color_lut:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "5"}, {"size": "3"}]}}, "image": {"name": "image:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "PartitionedCall/functional_3_1/curve_model_2_1/sub_7/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/range/start", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/range/delta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Reshape/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Tile/multiples/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/sub_4/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/add_2/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_5/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_5/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_5/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/sub_5/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_3/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/range_1/start", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/range_1/delta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Reshape_1/shape/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Reshape_1/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Reshape_1/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_4/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_4/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_4/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/sub_3/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/sub/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/sub_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Maximum/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_1/Minimum/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_2/Minimum/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_2/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_3/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_3/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Tile_1/multiples/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_4/Minimum/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_4/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "color_lut", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "5"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "image", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "luma_lut", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "5"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Shape_2", "op": "Shape", "input": ["color_lut"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/mul", "op": "Mul", "input": ["image", "PartitionedCall/functional_3_1/curve_model_2_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Shape", "op": "Shape", "input": ["luma_lut"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_5", "op": "StridedSlice", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/Shape_2", "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_5/stack", "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_5/stack_1", "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_5/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Sum", "op": "Sum", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/mul", "PartitionedCall/functional_3_1/curve_model_2_1/Sum/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/Shape", "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice/stack", "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice/stack_1", "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/sub_4", "op": "Sub", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_5", "PartitionedCall/functional_3_1/curve_model_2_1/sub_4/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/sub_5", "op": "Sub", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_5", "PartitionedCall/functional_3_1/curve_model_2_1/sub_5/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Maximum", "op": "Maximum", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/Sum", "PartitionedCall/functional_3_1/curve_model_2_1/Maximum/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/sub", "op": "Sub", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/strided_slice", "PartitionedCall/functional_3_1/curve_model_2_1/sub/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/sub_1", "op": "Sub", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/strided_slice", "PartitionedCall/functional_3_1/curve_model_2_1/sub_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Cast_3", "op": "Cast", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/sub_4"], "attr": {"SrcT": {"type": "DT_INT32"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Cast", "op": "Cast", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/sub"], "attr": {"SrcT": {"type": "DT_INT32"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/mul_1", "op": "Mul", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/Sum", "PartitionedCall/functional_3_1/curve_model_2_1/Cast"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Cast_1", "op": "Cast", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/mul_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Cast_2", "op": "Cast", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/Cast_1"], "attr": {"SrcT": {"type": "DT_INT32"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/add", "op": "AddV2", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/Cast_1", "PartitionedCall/functional_3_1/curve_model_2_1/add/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/GatherV2", "op": "GatherV2", "input": ["luma_lut", "PartitionedCall/functional_3_1/curve_model_2_1/Cast_1", "PartitionedCall/functional_3_1/curve_model_2_1/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "1"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/sub_2", "op": "Sub", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/mul_1", "PartitionedCall/functional_3_1/curve_model_2_1/Cast_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value/Minimum", "op": "Minimum", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/add", "PartitionedCall/functional_3_1/curve_model_2_1/sub_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/sub_3", "op": "Sub", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/sub_3/x", "PartitionedCall/functional_3_1/curve_model_2_1/sub_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value", "op": "Maximum", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value/Minimum", "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/mul_2", "op": "Mul", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/sub_3", "PartitionedCall/functional_3_1/curve_model_2_1/GatherV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/GatherV2_1", "op": "GatherV2", "input": ["luma_lut", "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value", "PartitionedCall/functional_3_1/curve_model_2_1/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "1"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/mul_3", "op": "Mul", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/sub_2", "PartitionedCall/functional_3_1/curve_model_2_1/GatherV2_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/add_1", "op": "AddV2", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/mul_2", "PartitionedCall/functional_3_1/curve_model_2_1/mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/truediv", "op": "RealDiv", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/add_1", "PartitionedCall/functional_3_1/curve_model_2_1/Maximum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_1/Minimum", "op": "Minimum", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/truediv", "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_1/Minimum/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_1", "op": "Maximum", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_1/Minimum", "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/mul_4", "op": "Mul", "input": ["image", "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_2/Minimum", "op": "Minimum", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/mul_4", "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_2/Minimum/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_2", "op": "Maximum", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_2/Minimum", "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_2/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/mul_5", "op": "Mul", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_2", "PartitionedCall/functional_3_1/curve_model_2_1/Cast_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Shape_1", "op": "Shape", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Cast_4", "op": "Cast", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/mul_5"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_4", "op": "StridedSlice", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/Shape_1", "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_4/stack", "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_4/stack_1", "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_4/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_1", "op": "StridedSlice", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/Shape_1", "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_1/stack", "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_1/stack_1", "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_2", "op": "StridedSlice", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/Shape_1", "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_2/stack", "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_2/stack_1", "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_2/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_3", "op": "StridedSlice", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/Shape_1", "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_3/stack", "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_3/stack_1", "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_3/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Cast_5", "op": "Cast", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/Cast_4"], "attr": {"SrcT": {"type": "DT_INT32"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/add_2", "op": "AddV2", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/Cast_4", "PartitionedCall/functional_3_1/curve_model_2_1/add_2/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/range_1", "op": "Range", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/range_1/start", "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_4", "PartitionedCall/functional_3_1/curve_model_2_1/range_1/delta"], "attr": {"Tidx": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Reshape_1/shape", "op": "Pack", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/Reshape_1/shape/0", "PartitionedCall/functional_3_1/curve_model_2_1/Reshape_1/shape/1", "PartitionedCall/functional_3_1/curve_model_2_1/Reshape_1/shape/2", "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_4"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/range", "op": "Range", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/range/start", "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_1", "PartitionedCall/functional_3_1/curve_model_2_1/range/delta"], "attr": {"Tidx": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Reshape/shape", "op": "Pack", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_1", "PartitionedCall/functional_3_1/curve_model_2_1/Reshape/shape/1", "PartitionedCall/functional_3_1/curve_model_2_1/Reshape/shape/2", "PartitionedCall/functional_3_1/curve_model_2_1/Reshape/shape/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Tile/multiples", "op": "Pack", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/Tile/multiples/0", "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_2", "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_3", "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_4"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Tile_1/multiples", "op": "Pack", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_1", "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_2", "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_3", "PartitionedCall/functional_3_1/curve_model_2_1/Tile_1/multiples/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/sub_6", "op": "Sub", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/mul_5", "PartitionedCall/functional_3_1/curve_model_2_1/Cast_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_3/Minimum", "op": "Minimum", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/add_2", "PartitionedCall/functional_3_1/curve_model_2_1/sub_5"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Reshape_1", "op": "Reshape", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/range_1", "PartitionedCall/functional_3_1/curve_model_2_1/Reshape_1/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Reshape", "op": "Reshape", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/range", "PartitionedCall/functional_3_1/curve_model_2_1/Reshape/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/sub_7", "op": "Sub", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/sub_7/x", "PartitionedCall/functional_3_1/curve_model_2_1/sub_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_3", "op": "Maximum", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_3/Minimum", "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_3/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Tile_1", "op": "Tile", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/Reshape_1", "PartitionedCall/functional_3_1/curve_model_2_1/Tile_1/multiples"], "attr": {"T": {"type": "DT_INT32"}, "Tmultiples": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Tile", "op": "Tile", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/Reshape", "PartitionedCall/functional_3_1/curve_model_2_1/Tile/multiples"], "attr": {"T": {"type": "DT_INT32"}, "Tmultiples": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/stack", "op": "Pack", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/Tile", "PartitionedCall/functional_3_1/curve_model_2_1/Cast_4", "PartitionedCall/functional_3_1/curve_model_2_1/Tile_1"], "attr": {"N": {"i": "3"}, "axis": {"i": "-1"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/stack_1", "op": "Pack", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/Tile", "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_3", "PartitionedCall/functional_3_1/curve_model_2_1/Tile_1"], "attr": {"N": {"i": "3"}, "axis": {"i": "-1"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/GatherNd", "op": "GatherNd", "input": ["color_lut", "PartitionedCall/functional_3_1/curve_model_2_1/stack"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "bad_indices_policy": {"s": ""}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/GatherNd_1", "op": "GatherNd", "input": ["color_lut", "PartitionedCall/functional_3_1/curve_model_2_1/stack_1"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "bad_indices_policy": {"s": ""}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/mul_6", "op": "Mul", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/sub_7", "PartitionedCall/functional_3_1/curve_model_2_1/GatherNd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/mul_7", "op": "Mul", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/sub_6", "PartitionedCall/functional_3_1/curve_model_2_1/GatherNd_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/add_3", "op": "AddV2", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/mul_6", "PartitionedCall/functional_3_1/curve_model_2_1/mul_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_4/Minimum", "op": "Minimum", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/add_3", "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_4/Minimum/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_4", "op": "Maximum", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_4/Minimum", "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_4/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_4"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2129}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "PartitionedCall/functional_3_1/curve_model_2_1/sub_7/x", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/range/start", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/range/delta", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Reshape/shape/2", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Reshape/shape/3", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Tile/multiples/0", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/sub_4/y", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/add_2/y", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_5/stack", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_5/stack_1", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_5/stack_2", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/sub_5/y", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_3/y", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/range_1/start", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/range_1/delta", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Reshape_1/shape/0", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Reshape_1/shape/1", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Reshape_1/shape/2", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_4/stack", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_4/stack_1", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_4/stack_2", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_1/stack", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_1/stack_2", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_2/stack", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_2/stack_1", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_2/stack_2", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/sub_3/x", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/sub/y", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/add/y", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/sub_1/y", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value/y", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Const", "shape": [3], "dtype": "float32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Sum/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Maximum/y", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_1/Minimum/y", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_1/y", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_2/Minimum/y", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_2/y", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_3/stack", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_3/stack_1", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/strided_slice_3/stack_2", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/Tile_1/multiples/3", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_4/Minimum/y", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/functional_3_1/curve_model_2_1/clip_by_value_4/y", "shape": [], "dtype": "float32"}]}]}